#### DistributionType Enumeration

---

|  |
| --- |
| See Also |

The type of the distribution

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public enum DistributionType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DistributionType ``` |

| Visual C++ |
| --- |
| ``` public enum class DistributionType ``` |

# Members

| Member name | Description |
| --- | --- |
| Uniform | It is an uniform distribution. |
| VaryingLength | It is a varying length distribution. |

# See Also

Autodesk.Revit.DB.Structure Namespace